#+title: Stylesheets README
#+author: Bartev
#+date: 2022-10-23

Where files go.
https://lilypond.org/doc/v2.22/Documentation/learning/other-sources-of-information

usr/local/Cellar/lilypond/2.24.0_1/share/lilypond/2.24.0/ly

* Docker

To use in the docker image, copy these files to
=lilypond-docker/plugins/bv-lilyjazz/stylesheets=

* Mac (non-brew install)
To use in general, copy to the LilyPond path.

I think it goes here:

=/Applications/LilyPond.app/Contents/Resources/share/lilypond/current/ly=

(search path:
 `/Applications/LilyPond.app/Contents/Resources/share/lilypond/2.20.0/fonts/svg/:
/Applications/LilyPond.app/Contents/Resources/share/lilypond/2.20.0/fonts/type1/:
/Applications/LilyPond.app/Contents/Resources/share/lilypond/2.20.0/fonts/otf/:
/Applications/LilyPond.app/Contents/Resources/share/lilypond/2.20.0/scm:
/Applications/LilyPond.app/Contents/Resources/share/lilypond/2.20.0/ps:
/Applications/LilyPond.app/Contents/Resources/share/lilypond/2.20.0/ly:
y')

* Mac (brew install)

With a homebrew install, check in =/usr/local/Cellar/= or =/usr/local/opt/=

* Adding custom functions

Add custom =*.ily= files to [[file:bv-lilyjazz/stylesheets/]].
Then run the setup script ([[file:setup-custom-lily-files.sh]])
This will install the files in the current install location.
(Note: Current install is via homebrew - 2022-10-23)


* Get path to current version of Lilypond (installed with homebrew)

#+begin_src bash :results verbatim
  p1=$(readlink -f $(brew --prefix lilypond))
  echo $p1
#+end_src

#+RESULTS:
: /usr/local/Cellar/lilypond/2.24.0

#+begin_src bash :results verbatim
  v=$(brew list --versions lilypond)
  echo $v

  p1=$(readlink -f $(brew --prefix lilypond))
  echo $(basename $p1)
  echo $p1
  #+end_src

#+RESULTS:
: lilypond 2.24.0_1
: 2.24.0_1
: /usr/local/Cellar/lilypond/2.24.0_1

#+begin_src bash :results verbatim
  LILY_APP_DIR=$(readlink -f $(brew --prefix lilypond))
  LILY_VERSION=$(basename $LILY_APP_DIR)
  LILY_INSTALL_DIR=$LILY_APP_DIR/lilypond/**/

  echo $LILY_APP_DIR
  echo $LILY_VERSION
  echo $LILY_INSTALL_DIR
#+end_src

#+RESULTS:
: /usr/local/Cellar/lilypond/2.24.0_1
: 2.24.0_1
: /usr/local/Cellar/lilypond/2.24.0_1/lilypond/**/
